CHaerem/Glance/esp32-client/src/main.cpp
#include "EPD_13in3e.h"
#include "GUI_Paint.h"
#include "fonts.h"
#include <WiFi.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include "soc/rtc_cntl_reg.h"
#include "esp32-hal-cpu.h"
#include "esp_sleep.h"
#include "esp_task_wdt.h"

// Configuration constants
#define API_BASE_URL "http://serverpi.local:3000/api/"
#define STATUS_URL "http://serverpi.local:3000/api/device-status"
#define MIN_SLEEP_TIME 300000000ULL      // 5 minutes
#define MAX_SLEEP_TIME 4294967295ULL     // Max value for 32-bit unsigned long (about 71 minutes)
#define DEFAULT_SLEEP_TIME 3600000000ULL // 1 hour
#define BATTERY_PIN A13
#define LOW_BATTERY_THRESHOLD 3.3
#define DEVICE_ID "esp32-001"
#define FIRMWARE_VERSION "1.1.0"

// Enhanced communication constants
#define MAX_RETRY_ATTEMPTS 3
#define BASE_TIMEOUT 5000
#define MAX_TIMEOUT 15000
#define OFFLINE_BUFFER_SIZE 10
#define HEARTBEAT_INTERVAL 30000  // 30 seconds when staying awake
#define CONNECTION_CHECK_INTERVAL 5000  // 5 seconds

// Serial streaming constants
#define SERIAL_STREAM_BUFFER_SIZE 1024
#define SERIAL_STREAM_INTERVAL 10000  // Stream every 10 seconds when awake
#define SERIAL_STREAM_MIN_CHARS 50    // Minimum characters before streaming

// Communication state tracking
struct CommState {
    unsigned long lastSuccessfulContact = 0;
    unsigned long lastHeartbeat = 0;
    int consecutiveFailures = 0;
    bool serverReachable = false;
    int adaptiveTimeout = BASE_TIMEOUT;
};

// Offline buffer for logs and status updates
struct BufferedMessage {
    String endpoint;
    String payload;
    unsigned long timestamp;
    int retryCount;
};

// Serial streaming state
struct SerialStreamState {
    String buffer;
    unsigned long lastStreamTime = 0;
    boolean isStreaming = false;
    boolean streamingEnabled = false;
};

// Global state
CommState commState;
BufferedMessage offlineBuffer[OFFLINE_BUFFER_SIZE];
int bufferHead = 0;
int bufferCount = 0;
SerialStreamState serialStream;

// Improved base64 decoder with pre-allocated buffer
String base64_decode(String input)
{
    const char *chars = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
    
    // Remove any padding
    while (input.endsWith("="))
    {
        input.remove(input.length() - 1);
    }

    // Calculate output size and pre-allocate
    int outputSize = (input.length() * 3) / 4;
    String output;
    output.reserve(outputSize + 100); // Reserve memory to avoid reallocations

    Debug("Base64 input length: " + String(input.length()) + ", estimated output: " + String(outputSize) + "\r\n");

    for (int i = 0; i < input.length(); i += 4)
    {
        unsigned long combined = 0;
        int chars_count = 0;

        // Process 4 characters at a time
        for (int j = 0; j < 4 && (i + j) < input.length(); j++)
        {
            char c = input.charAt(i + j);
            int val = 0;

            // Find character in base64 alphabet using faster lookup
            if (c >= 'A' && c <= 'Z') {
                val = c - 'A';
            } else if (c >= 'a' && c <= 'z') {
                val = c - 'a' + 26;
            } else if (c >= '0' && c <= '9') {
                val = c - '0' + 52;
            } else if (c == '+') {
                val = 62;
            } else if (c == '/') {
                val = 63;
            }

            combined = (combined << 6) | val;
            chars_count++;
        }

        // Extract bytes
        if (chars_count >= 2)
        {
            output += (char)((combined >> 16) & 0xFF);
        }
        if (chars_count >= 3)
        {
            output += (char)((combined >> 8) & 0xFF);
        }
        if (chars_count >= 4)
        {
            output += (char)(combined & 0xFF);
        }

        // Reset watchdog periodically during long decode
        if (i % 1000 == 0) {
            esp_task_wdt_reset();
        }
    }

    Debug("Base64 decode completed, actual output length: " + String(output.length()) + "\r\n");
    return output;
}

// Global variables for power management
RTC_DATA_ATTR int bootCount = 0;
RTC_DATA_ATTR uint64_t lastSleepDuration = DEFAULT_SLEEP_TIME;


// Function declarations
void setupPowerManagement();
bool connectToWiFi();
bool fetchCurrentImage();
void reportDeviceStatus(const char *status, float batteryVoltage, int signalStrength);
void sendLogToServer(const char *message, const char *level = "INFO");
void generateAndDisplayBhutanFlag();
void generateSmallBhutanFlag();
bool streamImageWithCleanup();
void displayImageFromData(const uint8_t *imageData, int width, int height);
void displayTextMessage(const String &text);
void enterDeepSleep(uint64_t sleepTime);
float readBatteryVoltage();
bool checkForCommands();
void processCommand(const String &command, unsigned long duration);
bool parseStreamingJSON(HTTPClient &http);
String extractJSONField(const String &jsonChunk, const String &field, int &startPos);
int decodeBase64ToBuffer(const String &base64, uint8_t* buffer, int maxSize);
bool processStreamingImageData(WiFiClient* stream, String initialData, HTTPClient &http);
void displayRowData(const uint8_t* rowData, int row, int width);
uint8_t mapRGBToEink(uint8_t r, uint8_t g, uint8_t b);
void processRGBImageData(const uint8_t *rgbData, int width, int height);

// Enhanced communication functions
bool makeHttpRequest(const String &url, const String &method, const String &payload, String &response, int customTimeout = 0);
void bufferMessage(const String &endpoint, const String &payload);
void flushOfflineBuffer();
void updateCommState(bool success);
void sendHeartbeat();
bool isServerReachable();
void adaptiveDelay(int baseDelay);

// Serial streaming functions
void enableSerialStreaming();
void disableSerialStreaming();
void captureSerialOutput(const String &output);
void flushSerialStream();
size_t debugWrite(const uint8_t *buffer, size_t size);

