CHaerem/Glance/esp32-client/src/main.cpp
                // Keep only the image data portion and earlier fields
                String beforeImage = jsonAccumulator.substring(0, dataStart);
                String imageData = jsonAccumulator.substring(dataStart);
                
                // Process the image data directly without storing it all
                bool success = processStreamingImageData(stream, imageData, http);
                if (success) {
                    // Update sleep duration for next cycle
                    lastSleepDuration = (sleepDuration > 0) ? sleepDuration : DEFAULT_SLEEP_TIME;
                    return true;
                }
                return false;
            }
        }
        
        // Keep only recent data to prevent memory overflow
        if (jsonAccumulator.length() > 8192) {
            jsonAccumulator = jsonAccumulator.substring(4096);
        }
    }
    
    Debug("Streaming parse completed without finding image\r\n");
    
    // Update sleep duration even if no image
    lastSleepDuration = (sleepDuration > 0) ? sleepDuration : DEFAULT_SLEEP_TIME;
    
    return false;
}

// Extract a JSON field value from a string without full JSON parsing
String extractJSONField(const String &jsonChunk, const String &field, int &startPos) {
    String searchStr = "\"" + field + "\":";
    int fieldPos = jsonChunk.indexOf(searchStr, startPos);
    
    if (fieldPos == -1) return "";
    
    int valueStart = fieldPos + searchStr.length();
    
    // Skip whitespace
    while (valueStart < jsonChunk.length() && (jsonChunk[valueStart] == ' ' || jsonChunk[valueStart] == '\t')) {
        valueStart++;
    }
    
    if (valueStart >= jsonChunk.length()) return "";
    
    String value = "";
    
    if (jsonChunk[valueStart] == '"') {
        // String value
        valueStart++; // Skip opening quote
        int valueEnd = valueStart;
        while (valueEnd < jsonChunk.length() && jsonChunk[valueEnd] != '"') {
            if (jsonChunk[valueEnd] == '\\') valueEnd++; // Skip escaped characters
            valueEnd++;
        }
        if (valueEnd < jsonChunk.length()) {
            value = jsonChunk.substring(valueStart, valueEnd);
        }
    } else {
        // Numeric value
        int valueEnd = valueStart;
        while (valueEnd < jsonChunk.length() && 
               (isdigit(jsonChunk[valueEnd]) || jsonChunk[valueEnd] == '.' || jsonChunk[valueEnd] == '-')) {
            valueEnd++;
        }
        value = jsonChunk.substring(valueStart, valueEnd);
    }
    
    startPos = valueStart + value.length();
    return value;
}

// Process image data directly from stream without storing it all in memory
bool processStreamingImageData(WiFiClient* stream, String initialData, HTTPClient &http) {
    Debug("Processing streaming image data...\r\n");
    Debug("Initial data length: " + String(initialData.length()) + "\r\n");
    
    // Clear display first
    EPD_13IN3E_Clear(EPD_13IN3E_WHITE);
    delay(3000);
    
    // Removed old DECODE_CHUNK_SIZE - now defined below
    String base64Chunk = initialData;
    
    // Allocate buffer for RGB processing
    const int RGB_BUFFER_SIZE = 3600; // 1200 pixels * 3 channels = enough for 1 row
    uint8_t* rgbBuffer = (uint8_t*)malloc(RGB_BUFFER_SIZE);
    if (!rgbBuffer) {
        Debug("Failed to allocate RGB buffer!\r\n");
        return false;
    }
    
    // Allocate buffer for e-ink row data
    uint8_t* einkRowBuffer = (uint8_t*)malloc(1200); // 1 row of e-ink data
    if (!einkRowBuffer) {
        Debug("Failed to allocate e-ink row buffer!\r\n");
        free(rgbBuffer);
        return false;
    }
    
    Debug("Starting row-by-row processing...\r\n");
    
    // Ultra-conservative approach: process only small chunks and never store large data
    Debug("Processing image with minimal memory usage...\r\n");
    
    int totalImageBytes = 0;
    int rowsProcessed = 0;
    
    // Very small buffer for base64 processing
    String smallBase64Buffer = base64Chunk; // Start with initial data
    
    for (int row = 0; row < 1600; row++) {
        esp_task_wdt_reset();
        
        // Try to get enough base64 data for one row (need ~4800 chars for 3600 bytes)
        while (smallBase64Buffer.length() < 5000 && http.connected()) {
            char buffer[1024];
            int bytesRead = stream->readBytes(buffer, 1023);
            if (bytesRead <= 0) break;
            buffer[bytesRead] = '\0';
            
            // Clean and append only base64 characters
            for (int i = 0; i < bytesRead; i++) {
                char c = buffer[i];
                if ((c >= 'A' && c <= 'Z') || (c >= 'a' && c <= 'z') || 
                    (c >= '0' && c <= '9') || c == '+' || c == '/' || c == '=') {
                    smallBase64Buffer += c;
                }
            }
            
            // Prevent buffer from growing too large - keep only recent data
            if (smallBase64Buffer.length() > 10000) {
                smallBase64Buffer = smallBase64Buffer.substring(smallBase64Buffer.length() - 8000);
            }
        }
        
        if (smallBase64Buffer.length() < 1000) {
            Debug("Insufficient base64 data for row " + String(row) + "\r\n");
            break;
        }
        
        // Try to decode what we have
        int decoded = decodeBase64ToBuffer(smallBase64Buffer, rgbBuffer, RGB_BUFFER_SIZE);
        
        if (decoded >= 3597) { // Accept close-enough decoding
            // Process this row
            for (int col = 0; col < 1200; col++) {
                uint8_t r = rgbBuffer[col * 3];
                uint8_t g = rgbBuffer[col * 3 + 1];
                uint8_t b = rgbBuffer[col * 3 + 2];
                einkRowBuffer[col] = mapRGBToEink(r, g, b);
            }
            
            displayRowData(einkRowBuffer, row, 1200);
            totalImageBytes += decoded; // Use actual decoded amount
            rowsProcessed++;
            
