CHaerem/Glance/esp32-client/src/main.cpp
    // Step 5: Display image with single refresh (like original Bhutan flag!)
    if (totalBytesRead >= actualBufferSize * 0.9) { // Allow for some size variance
        Debug("Image stream successful - displaying with SINGLE refresh...\r\n");
        
        if (actualBufferSize == BUFFER_SIZE) {
            // Full resolution display
            EPD_13IN3E_Display(imageBuffer);
            Debug("PERFECT: Single refresh complete! Full resolution image displayed.\r\n");
        } else {
            // Reduced resolution - center on display
            int displayWidth = 600;
            int displayHeight = 800;
            int xOffset = (1200 - displayWidth) / 2;
            int yOffset = (1600 - displayHeight) / 2;
            EPD_13IN3E_DisplayPart(imageBuffer, xOffset, yOffset, displayWidth, displayHeight);
            Debug("GOOD: Single refresh complete! Reduced resolution image displayed.\r\n");
        }
    } else {
        Debug("ERROR: Incomplete image received, not displaying\r\n");
    }
    
    // Step 6: Free buffer
    if (actualBufferSize == BUFFER_SIZE) {
        heap_caps_free(imageBuffer);
    } else {
        free(imageBuffer);
    }
    Debug("Buffer freed\r\n");
    
    return totalBytesRead >= actualBufferSize * 0.9;
}

// Override current approach with proper WiFi streaming (your friend's brilliant method)
void displayRowData(const uint8_t* rowData, int row, int width) {    
    static bool wifiStreamingAttempted = false;
    
    if (!wifiStreamingAttempted) {
        Debug("Attempting WiFi streaming with proper cleanup approach...\r\n");
        bool success = streamImageWithCleanup();
        if (!success) {
            Debug("WiFi streaming failed - generating flag as fallback\r\n");
            generateAndDisplayBhutanFlag();
        }
        wifiStreamingAttempted = true;
    }
}

// Your friend's approach: Stream → RAM → Cleanup → Display
bool streamImageWithCleanup() {
    Debug("=== WIFI STREAMING WITH PROPER CLEANUP ===\r\n");
    Debug("Step 1: Pre-allocate image buffer\r\n");
    Debug("Free heap before allocation: " + String(ESP.getFreeHeap()) + " bytes\r\n");
    
    const int IMAGE_SIZE = (1200 * 1600) / 2; // 937KB for 4-bit packed
    
    // Step 1: Pre-allocate image buffer (while heap is still clean)
    uint8_t* imageBuffer = (uint8_t*)malloc(IMAGE_SIZE);
    if (imageBuffer == nullptr) {
        Debug("ERROR: Cannot pre-allocate 937KB image buffer\r\n");
        Debug("Available heap: " + String(ESP.getFreeHeap()) + " bytes\r\n");
        return false;
    }
    
    Debug("SUCCESS: Pre-allocated 937KB image buffer\r\n");
    Debug("Free heap after allocation: " + String(ESP.getFreeHeap()) + " bytes\r\n");
    
    // Step 2: Stream raw binary data into the buffer
    Debug("Step 2: Streaming raw binary image data\r\n");
    
    HTTPClient http;
    http.setTimeout(60000);
    http.begin("http://serverpi.local:3000/api/image.bin");
    
    int httpCode = http.GET();
    if (httpCode != HTTP_CODE_OK) {
        Debug("ERROR: HTTP failed: " + String(httpCode) + "\r\n");
        free(imageBuffer);
        http.end();
        return false;
    }
    
    int contentLength = http.getSize();
    Debug("Content-Length: " + String(contentLength) + " bytes\r\n");
    
    // Stream data directly into pre-allocated buffer
    WiFiClient* stream = http.getStreamPtr();
    int totalBytesRead = 0;
    
    while (http.connected() && totalBytesRead < IMAGE_SIZE) {
        size_t available = stream->available();
        if (available > 0) {
            int chunkSize = min((int)available, min(4096, IMAGE_SIZE - totalBytesRead));
            int bytesRead = stream->readBytes(imageBuffer + totalBytesRead, chunkSize);
            totalBytesRead += bytesRead;
            
            if (totalBytesRead % 100000 == 0) {
                Debug("Downloaded " + String(totalBytesRead/1024) + "KB / " + String(IMAGE_SIZE/1024) + "KB\r\n");
            }
        } else {
            delay(10);
        }
    }
    
    Debug("Download complete: " + String(totalBytesRead) + " bytes\r\n");
    
    // Step 3: CRITICAL - Completely release WiFi/HTTP resources
    Debug("Step 3: Releasing ALL WiFi/HTTP resources\r\n");
    Debug("Free heap before cleanup: " + String(ESP.getFreeHeap()) + " bytes\r\n");
    
    http.end();              // Close HTTP connection
    WiFi.disconnect(true);   // Disconnect WiFi
    WiFi.mode(WIFI_OFF);     // Turn off WiFi completely
    delay(100);              // Let WiFi stack clean up
    
    Debug("WiFi/HTTP completely released\r\n");
    Debug("Free heap after cleanup: " + String(ESP.getFreeHeap()) + " bytes\r\n");
    
    // Step 4: Now display with single refresh (heap is clean!)
    if (totalBytesRead >= IMAGE_SIZE * 0.9) {
        Debug("Step 4: Displaying with SINGLE refresh (clean heap)\r\n");
        EPD_13IN3E_Display(imageBuffer);
        Debug("PERFECT: WiFi image displayed with single refresh!\r\n");
        
        free(imageBuffer);
        Debug("Image buffer freed. Mission accomplished!\r\n");
        return true;
    } else {
        Debug("ERROR: Incomplete download\r\n");
        free(imageBuffer);
        return false;
    }
}

// Generate Bhutan flag directly - the approach that worked originally
void generateAndDisplayBhutanFlag() {
    Debug("=== GENERATING BHUTAN FLAG DIRECTLY (original working approach) ===\r\n");
    Debug("Free heap before generation: " + String(ESP.getFreeHeap()) + " bytes\r\n");
    
    const int width = 1200;
    const int height = 1600;
    const int BUFFER_SIZE = (width * height) / 2; // 960KB
    
    // Try to allocate the full buffer 
    uint8_t* flagBuffer = (uint8_t*)malloc(BUFFER_SIZE);
    if (flagBuffer == nullptr) {
        Debug("Cannot allocate full buffer - WiFi/HTTP is using too much memory\r\n");
        Debug("Generating smaller flag instead...\r\n");
        
        // Generate smaller flag that fits in available memory
        generateSmallBhutanFlag();
        return;
    }
    
    Debug("SUCCESS: Allocated " + String(BUFFER_SIZE/1024) + "KB for Bhutan flag\r\n");
    Debug("Free heap after allocation: " + String(ESP.getFreeHeap()) + " bytes\r\n");
    
