CHaerem/Glance/esp32-client/src/main.cpp
    // Generate Bhutan flag colors (same as original)
    const uint8_t YELLOW = 0x2;
    const uint8_t ORANGE = 0x3; 
    const uint8_t WHITE_COLOR = 0x1;
    
    Debug("Generating flag pixels...\r\n");
    
    // Fill with diagonal split and dragon (exactly like original)
    for (int y = 0; y < height; y++) {
        for (int x = 0; x < width; x++) {
            int pixelIndex = y * width + x;
            int byteIndex = pixelIndex / 2;
            bool isEvenPixel = (pixelIndex % 2) == 0;
            
            uint8_t color;
            int diagonalThreshold = (width + height) / 2;
            if (x + y < diagonalThreshold) {
                color = YELLOW;
            } else {
                color = ORANGE;
            }
            
            // Simple dragon in center
            int centerX = width / 2;
            int centerY = height / 2;
            int dragonRadius = 200;
            int dx = x - centerX;
            int dy = y - centerY;
            if (dx*dx + dy*dy < dragonRadius*dragonRadius) {
                color = WHITE_COLOR;
            }
            
            // Pack color
            if (isEvenPixel) {
                flagBuffer[byteIndex] = (color << 4);
            } else {
                flagBuffer[byteIndex] |= color;
            }
        }
        
        if (y % 400 == 0) {
            Debug("Generated " + String(y) + " rows\r\n");
        }
    }
    
    Debug("Flag generation complete - displaying with SINGLE refresh...\r\n");
    EPD_13IN3E_Display(flagBuffer);
    Debug("SUCCESS: Bhutan flag displayed with single refresh! Just like original.\r\n");
    
    free(flagBuffer);
    Debug("Flag generation complete. Free heap: " + String(ESP.getFreeHeap()) + " bytes\r\n");
}

void generateSmallBhutanFlag() {
    Debug("Generating 600×800 Bhutan flag...\r\n");
    const int width = 600;
    const int height = 800;
    const int BUFFER_SIZE = (width * height) / 2; // 240KB
    
    uint8_t* flagBuffer = (uint8_t*)malloc(BUFFER_SIZE);
    if (flagBuffer == nullptr) {
        Debug("ERROR: Cannot even allocate small flag buffer\r\n");
        return;
    }
    
    // Same flag generation logic but smaller
    const uint8_t YELLOW = 0x2;
    const uint8_t ORANGE = 0x3;
    const uint8_t WHITE_COLOR = 0x1;
    
    for (int y = 0; y < height; y++) {
        for (int x = 0; x < width; x++) {
            int pixelIndex = y * width + x;
            int byteIndex = pixelIndex / 2;
            bool isEvenPixel = (pixelIndex % 2) == 0;
            
            uint8_t color;
            int diagonalThreshold = (width + height) / 2;
            if (x + y < diagonalThreshold) {
                color = YELLOW;
            } else {
                color = ORANGE;
            }
            
            int centerX = width / 2;
            int centerY = height / 2;
            int dragonRadius = 100; // Smaller dragon
            int dx = x - centerX;
            int dy = y - centerY;
            if (dx*dx + dy*dy < dragonRadius*dragonRadius) {
                color = WHITE_COLOR;
            }
            
            if (isEvenPixel) {
                flagBuffer[byteIndex] = (color << 4);
            } else {
                flagBuffer[byteIndex] |= color;
            }
        }
    }
    
    Debug("Small flag complete - displaying centered...\r\n");
    int xOffset = (1200 - width) / 2;
    int yOffset = (1600 - height) / 2;
    EPD_13IN3E_DisplayPart(flagBuffer, xOffset, yOffset, width, height);
    Debug("Small Bhutan flag displayed!\r\n");
    
    free(flagBuffer);
}